//====================================================================================================
//
// 背景処理 (bg.h)
// Author (Kimura kouta)
//
//====================================================================================================
#ifndef _BG_H_
#define _BG_H_

//====================================================================================================
//インクリードファイル
//====================================================================================================
#include"main.h"
#include"Scene2D.h"

#define MAX_TEX (10)	//読み込むテクスチャファイル名

//================================================================
// レンダリングクラス
//================================================================
class CBg : public CScene2D
{
public:

	//================================================================
	// プロトタイプ宣言
	//================================================================
	CBg(OBJTYPE type);
	CBg();
	~CBg();

	HRESULT Init(D3DXVECTOR3 pos, float move);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	static CBg *Create(D3DXVECTOR3 pos, float move, int nCnt);
	static HRESULT Load(void);
	static void Unload(void);

private:

	VERTEX_2D m_Vertex[4];
	static LPDIRECT3DTEXTURE9 m_pTextureBg[MAX_TEX];
	LPDIRECT3DVERTEXBUFFER9 m_pVtxBuffPlayer = NULL;		// 頂点バッファへのポインタ
};


//====================================================================================================
// マクロ定義
//==================================================================================================== 
#endif
