//====================================================================================================
//
// アイテム処理 (Item.h)
// Author (Kimura kouta)
//
//====================================================================================================
#ifndef _ITEM_H_
#define _ITEM_H_

//====================================================================================================
//インクリードファイル
//====================================================================================================
#include"main.h"
#include"Scene2D.h"

#define MAX_ITEMTEX (1)	//読み込むテクスチャファイル名

//================================================================
// レンダリングクラス
//================================================================
class CItem : public CScene2D
{
public:

	//================================================================
	// プロトタイプ宣言
	//================================================================
	CItem(OBJTYPE type);
	~CItem();

	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	void SetMove(D3DXVECTOR3 move);
	static CItem *Create(void);
	static HRESULT Load(void);
	static void Unload(void);
	void CollisionPL(void);
	D3DXVECTOR3 GetIPos(void);


private:

	VERTEX_2D m_Vertex[4];
	static LPDIRECT3DTEXTURE9 m_pTextureItem[MAX_ITEMTEX];
	D3DXVECTOR3 m_move;
	D3DXVECTOR3 m_pos;
};

//====================================================================================================
// マクロ定義
//==================================================================================================== 
#endif
