//====================================================================================================
//
// HP処理 (Life.h)
// Author (Kimura kouta)
//
//====================================================================================================
#ifndef _LIFE_H_
#define _LIFE_H_

//====================================================================================================
//インクリードファイル
//====================================================================================================
#include"main.h"
#include"Scene2D.h"

#define MAX_LIFE (3)	//読み込むテクスチャファイル名

//================================================================
// レンダリングクラス
//================================================================
class CLife : public CScene2D
{
public:

	//================================================================
	// プロトタイプ宣言
	//================================================================
	CLife(OBJTYPE type);
	~CLife();

	HRESULT Init(D3DXVECTOR3 pos);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	static CLife *Create(D3DXVECTOR3 pos);
	static HRESULT Load(void);
	static void Unload(void);
	void AddLife(int nNumber);


private:

	VERTEX_2D m_Vertex[4];
	static LPDIRECT3DTEXTURE9 m_pTextureLife[MAX_LIFE];
	D3DXVECTOR3 m_pos;
	int m_nLife;

};

//====================================================================================================
// マクロ定義
//==================================================================================================== 
#endif
