//=============================================================================
//
// ランキング背景ヘッダー処理の説明[rankbg.h]
// Author :  Kimura Kouta
//
//=============================================================================
#ifndef _RANKBG_H_
#define _RANKBG_H_	 // ファイル名を基準を決める

//=============================================================================
//
// インクルードファイル
//
//=============================================================================
#define _CRT_SECURE_NO_WARNINGS
#include "main.h"
#include "Scene.h"

//================================================================
// レンダリングクラス
//================================================================
class CRankBG : public CScene
{
public:

	//====================================================================================================
	// 構造体定義
	//=====================================================================================================
	typedef struct
	{
		D3DXVECTOR3 pos;	//ポジション
		float       rhw;	//1で固定する
		D3DCOLOR    col;	//色
		D3DXVECTOR2 tex;	//テクスチャ情報
	}VERTEX_2D;

	//=============================================================================
	// プロトタイプ宣言
	//=============================================================================
	CRankBG();
	~CRankBG();
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
	static CRankBG *Create();

private:

	LPDIRECT3DTEXTURE9 m_pTextureRankbg = NULL;					// テクスチャへのポインタ
	LPDIRECT3DVERTEXBUFFER9 m_pVtxBuffRankbg = NULL;			// テクスチャへのポインタ
	float m_fRankbgY;											// yのポジション
	int m_nCntRankbg;											// ランキング背景カウント
	int m_nNumRankbg;											// ランキング背景番号
};
#endif