//=============================================================================
//
// ランキング処理 [rankingAll.h]
// Author :  Kimura Kouta
//
//=============================================================================
#ifndef _RANKINGALL_H_
#define _RANKINGALL_H_

//=============================================================================
//
// インクルードファイル
//
//=============================================================================
#define _CRT_SECURE_NO_WARNINGS

#include "main.h"
#include "Scene.h"

#define RANKING_DATE (5)									// ランキング数

class CRanking;
//================================================================
// レンダリングクラス
//================================================================
class CRankingAll
{
public:

	//=============================================================================
	//
	// プロトタイプ宣言
	//
	//=============================================================================

	CRankingAll();
	~CRankingAll();

	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	// ランキング計算関数
	static CRankingAll * Create();

private:
	static CRanking *pRanking;
};
#endif

